wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/i2c_reg.h
 * |        |          |Note: Setup time setting should not make SCL output less than three PCLKs.
 * |[24:16] |HTCTL     |Hold Time Configure Control
 * |        |          |This field is used to generate the delay timing between SCL falling edge and SDA rising edge in transmission mode.
 * |        |          |The delay hold time is numbers of peripheral clock = HTCTL x PCLK.
 * @var I2C_T::BUSCTL
 * Offset: 0x50  I2C Bus Management Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ACKMEN    |Acknowledge Control by Manual
 * |        |          |In order to allow ACK control in slave reception including the command and data, slave byte control mode must be enabled by setting the ACKMEN bit.
 * |        |          |0 = Slave byte control Disabled.
 * |        |          |1 = Slave byte control Enabled
 * |        |          |The 9th bit can response the ACK or NACK according the received data by user
 * |        |          |When the byte is received, stretching the SCL signal low between the 8th and 9th SCL pulse.
 * |        |          |Note: If the BMDEN =1 and this bit is enabled, the information of I2C_STATUS0 will be fixed as 0xF0 in slave receive condition.
 * |[1]     |PECEN     |Packet Error Checking Calculation Enable Bit
 * |        |          |0 = Packet Error Checking Calculation Disabled.
 * |        |          |1 = Packet Error Checking Calculation Enabled.
 * |        |          |Note: When I2C enter power-down mode, the bit should be enabled after wake-up if needed PEC calculation.
 * |[2]     |BMDEN     |Bus Management Device Default Address Enable Bit
 * |        |          |0 = Device default address Disable
 * |        |          |When the address 0'b1100001x comes and either BMDEN or ACKMEN is disabled, the device responses NACK.
 * |        |          |1 = Device default address Enabled
 * |        |          |When the address 0'b1100001x comes and both BMDEN and ACKMEN are enabled, the device responses ACK.
 * |[3]     |BMHEN     |Bus Management Host Enable Bit
 * |        |          |0 = Host function Disabled.
 * |        |          |1 = Host function Enabled.
 * |[4]     |ALERTEN   |Bus Management Alert Enable Bit
 * |        |          |Device Mode (BMHEN =0).
 * |        |          |0 = Release the BM_ALERT pin high and Alert Response Header disabled: 0001100x followed by NACK if both of BMDEN and ACKMEN are enabled.
 * |        |          |1 = Drive BM_ALERT pin low and Alert Response Address Header enables: 0001100x followed by ACK if both of BMDEN and ACKMEN are enabled.
 * |        |          |Host Mode (BMHEN =1).
 * |        |          |0 = BM_ALERT pin not supported.
 * |        |          |1 = BM_ALERT pin supported.
 * |[5]     |SCTLOSTS  |Suspend/Control Data Output Status
 * |        |          |0 = The output of SUSCON pin is low.
 * |        |          |1 = The output of SUSCON pin is high.
 * |[6]     |SCTLOEN   |Suspend or Control Pin Output Enable Bit
 * |        |          |0 = The SUSCON pin in input.
 * |        |          |1 = The output enable is active on the SUSCON pin.
 * |[7]     |BUSEN     |BUS Enable Bit
 * |        |          |0 = The system management function Disabled.
 * |        |          |1 = The system management function Enabled.
 * |        |          |Note: When the bit is enabled, the internal 14-bit counter is used to calculate the time out event of clock low condition.
 * |[8]     |PECTXEN   |Packet Error Checking Byte Transmission/Reception
 * |        |          |0 = No PEC transfer.
 * |        |          |1 = PEC transmission is requested.
 * |        |          |Note: 1.This bit has no effect in slave mode when ACKMEN =0.
 * |[9]     |TIDLE     |Timer Check in Idle State
 * |        |          |The BUSTOUT is used to calculate the time-out of clock low in bus active and the idle period in bus Idle
 * |        |          |This bit is used to define which condition is enabled.
 * |        |          |0 = BUSTOUT is used to calculate the clock low period in bus active.
 * |        |          |1 = BUSTOUT is used to calculate the IDLE period in bus Idle.
 * |        |          |Note: The BUSY (I2C_BUSSTS[0]) indicate the current bus state.
 * |[10]    |PECCLR    |PEC Clear at Repeat Start
 * |        |          |The calculation of PEC starts when PECEN is set to 1 and it is cleared when the STA or STO bit is detected
 * |        |          |This PECCLR bit is used to enable the condition of REPEAT START can clear the PEC calculation.
 * |        |          |0 = PEC calculation is cleared by u201CRepeat Startu201D function Disabled.
 * |        |          |1 = PEC calculation is cleared by u201CRepeat Startu201D function Enabled.
 * |[11]    |ACKM9SI   |Acknowledge Manual Enable Extra SI Interrupt
 * |        |          |0 = There is no SI interrupt in the 9th clock cycle when the BUSEN =1 and ACKMEN =1.
 * |        |          |1 = There is SI interrupt in the 9th clock cycle when the BUSEN =1 and ACKMEN =1. 
 * |[12]    |BCDIEN    |Packet Error Checking Byte Count Done Interrupt Enable Bit
 * |        |          |0 = Byte count done interrupt Disabled.
 * |        |          |1 = Byte count done interrupt Enabled.
 * |        |          |Note: This bit is used in PECEN =1.
 * |[13]    |PECDIEN   |Packet Error Checking Byte Transfer Done Interrupt Enable Bit
 * |        |          |0 = PEC transfer done interrupt Disabled.
 * |        |          |1 = PEC transfer done interrupt Enabled.
 * |        |          |Note: This bit is used in PECEN =1.
 * @var I2C_T::BUSTCTL
 * Offset: 0x54  I2C Bus Management Timer Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BUSTOEN   |Bus Time Out Enable Bit
 * |        |          |0 = Bus clock low time-out detection Disabled.
 * |        |          |1 = Bus clock low time-out detection Enabled (bus clock is low for more than BUSTO (I2C_BUSTOUT[7:0]) (in TIDLE=0) or high more than BUSTO (in TIDLE =1)
 * |[1]     |CLKTOEN   |Cumulative Clock Low Time Out Enable Bit
 * |        |          |0 = Cumulative clock low time-out detection Disabled.
 * |        |          |1 = Cumulative clock low time-out detection Enabled.
 * |        |          |For Master, it calculates the period from START to ACK
 * |        |          |For Slave, it calculates the period from START to STOP
 * |[2]     |BUSTOIEN  |Time-out Interrupt Enable Bit
 * |        |          |BUSY =1.
 * |        |          |0 = SCL low time-out interrupt Disabled.
 * |        |          |1 = SCL low time-out interrupt Enabled.
 * |        |          |BUSY =0.
 * |        |          |0 = Bus IDLE time-out interrupt Disabled.
 * |        |          |1 = Bus IDLE time-out interrupt Enabled.
 * |[3]     |CLKTOIEN  |Extended Clock Time Out Interrupt Enable Bit
 * |        |          |0 = Clock time out interrupt Disabled.
 * |        |          |1 = Clock time out interrupt Enabled.
 * |[4]     |TORSTEN   |Time Out Reset Enable Bit
 * |        |          |0 = I2C state machine reset Disabled.
 * |        |          |1 = I2C state machine reset Enabled. (The clock and data bus will be released to high)
 * @var I2C_T::BUSSTS
 * Offset: 0x58  I2C Bus Management Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BUSY      |Bus Busy (Read Only)
 * |        |          |Indicates that a communication is in progress on the bus
 * |        |          |It is set by hardware when a START condition is detected
 * |        |          |It is cleared by hardware when a STOP condition is detected
 * |        |          |0 = Bus is IDLE (both SCL and SDA High).
 * |        |          |1 = Bus is busy.
 * |[1]     |BCDONE    |Byte Count Transmission/Receive Done
 * |        |          |0 = Byte count transmission/ receive is not finished when the PECEN is set.
 * |        |          |1 = Byte count transmission/ receive is finished when the PECEN is set.
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[2]     |PECERR    |PEC Error in Reception
 * |        |          |0 = PEC value equal the received PEC data packet.
 * |        |          |1 = PEC value doesn't match the receive PEC data packet.
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[3]     |ALERT     |SMBus Alert Status
 * |        |          |Device Mode (BMHEN =0).
 * |        |          |0 = SMBALERT pin state is low.
 * |        |          |1 = SMBALERT pin state is high.
 * |        |          |Host Mode (BMHEN =1).
 * |        |          |0 = No SMBALERT event.
 * |        |          |1 = There is SMBALERT event (falling edge) is detected in SMALERT pin when the BMHEN = 1 (SMBus host configuration) and the ALERTEN = 1.
 * |        |          |Note 1: The SMBALERT pin is an open-drain pin, and the pull-high resistor is must in the system.
 * |        |          |Note 2: Software can write 1 to clear this bit.
 * |[4]     |SCTLDIN   |Bus Suspend or Control Signal Input Status (Read Only)
 * |        |          |0 = The input status of SUSCON pin is 0.
 * |        |          |1 = The input status of SUSCON pin is 1.
 * |[5]     |BUSTO     |Bus Time-out Status
 * |        |          |0 = There is no any time-out or external clock time-out.
 * |        |          |1 = A time-out or external clock time-out occurred.
 * |        |          |In bus busy, the bit indicates the total clock low time-out event occurred; otherwise, it indicates the bus idle time-out event occurred.
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[6]     |CLKTO     |Clock Low Cumulate Time-out Status
 * |        |          |0 = Cumulative clock low is no any time-out.
 * |        |          |1 = Cumulative clock low time-out occurred.
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[7]     |PECDONE   |PEC Byte Transmission/Receive Done
 * |        |          |0 = PEC transmission/ receive is not finished when the PECEN is set.
 * |        |          |1 = PEC transmission/ receive is finished when the PECEN is set.
 * |        |          |Note: Software can write 1 to clear this bit.
 * @var I2C_T::PKTSIZE
 * Offset: 0x5C  I2C Packet Error Checking Byte Number Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[8:0]   |PLDSIZE   |Transfer Byte Number
 * |        |          |The transmission or receive byte number in one transaction when the PECEN is set
 * |        |          |The maximum transaction or receive byte is 256 Bytes.
 * |        |          |Note: The byte number counting includes address, command code, and data frame.
 * @var I2C_T::PKTCRC
 * Offset: 0x60  I2C Packet Error Checking Byte Value Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |PECCRC    |Packet Error Checking Byte Value
 * |        |          |This byte indicates the packet error checking content after transmission or receive byte count by using the C(x) = X8 + X2 + X + 1
 * |        |          |It is read only.
 * @var I2C_T::BUSTOUT
 * Offset: 0x64  I2C Bus Management Timer Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |BUSTO     |Bus Management Time-out Value
 * |        |          |Indicates the bus time-out value in bus is IDLE or SCL low.
 * |        |          |Note: If the user wants to revise the value of BUSTOUT, the TORSTEN (I2C_BUSTCTL[4]) bit shall be set to 1 and cleared to 0 first when the BUSEN(I2C_BUSCTL[7]) is set.
 * @var I2C_T::CLKTOUT
 * Offset: 0x68  I2C Bus Management Clock Low Timer Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CLKTO     |Bus Clock Low Timer
 * |        |          |The field is used to configure the cumulative clock extension time-out.
 * |        |          |Note: If the user wants to revise the value of CLKTOUT, the TORSTEN bit shall be set to 1 and cleared to 0 first when the BUSEN is set.
 */
    __IO uint32_t CTL0;                  /*!< [0x0000] I2C Control Register 0                                           */
    __IO uint32_t ADDR0;                 /*!< [0x0004] I2C Slave Address Register0                                      */
    __IO uint32_t DAT;                   /*!< [0x0008] I2C Data Register                                                */
    __I  uint32_t STATUS0;               /*!< [0x000c] I2C Status Register 0                                            */
    __IO uint32_t CLKDIV;                /*!< [0x0010] I2C Clock Divided Register                                       */
    __IO uint32_t TOCTL;                 /*!< [0x0014] I2C Time-out Control Register                                    */
    __IO uint32_t ADDR1;                 /*!< [0x0018] I2C Slave Address Register1                                      */
    __IO uint32_t ADDR2;                 /*!< [0x001c] I2C Slave Address Register2                                      */
    __IO uint32_t ADDR3;                 /*!< [0x0020] I2C Slave Address Register3                                      */
    __IO uint32_t ADDRMSK0;              /*!< [0x0024] I2C Slave Address Mask Register0                                 */
    __IO uint32_t ADDRMSK1;              /*!< [0x0028] I2C Slave Address Mask Register1                                 */
    __IO uint32_t ADDRMSK2;              /*!< [0x002c] I2C Slave Address Mask Register2                                 */
    __IO uint32_t ADDRMSK3;              /*!< [0x0030] I2C Slave Address Mask Register3                                 */
    __I  uint32_t RESERVE0[2];
    __IO uint32_t WKCTL;                 /*!< [0x003c] I2C Wake-up Control Register                                     */
    __IO uint32_t WKSTS;                 /*!< [0x0040] I2C Wake-up Status Register                                      */
    __IO uint32_t CTL1;                  /*!< [0x0044] I2C Control Register 1                                           */
    __IO uint32_t STATUS1;               /*!< [0x0048] I2C Status Register 1                                            */
    __IO uint32_t TMCTL;                 /*!< [0x004c] I2C Timing Configure Control Register                            */
    __IO uint32_t BUSCTL;                /*!< [0x0050] I2C Bus Management Control Register                              */
    __IO uint32_t BUSTCTL;               /*!< [0x0054] I2C Bus Management Timer Control Register                        */
    __IO uint32_t BUSSTS;                /*!< [0x0058] I2C Bus Management Status Register                               */
    __IO uint32_t PKTSIZE;               /*!< [0x005c] I2C Packet Error Checking Byte Number Register                   */
    __I  uint32_t PKTCRC;                /*!< [0x0060] I2C Packet Error Checking Byte Value Register                    */
    __IO uint32_t BUSTOUT;               /*!< [0x0064] I2C Bus Management Timer Register                                */
    __IO uint32_t CLKTOUT;               /*!< [0x0068] I2C Bus Management Clock Low Timer Register                      */

