wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/i2c_reg.h
} I2C_T;

/**
    @addtogroup I2C_CONST I2C Bit Field Definition
    Constant Definitions for I2C Controller
@{ */

#define I2C_CTL0_AA_Pos                  (2)                                               /*!< I2C_T::CTL0: AA Position               */
#define I2C_CTL0_AA_Msk                  (0x1ul << I2C_CTL0_AA_Pos)                        /*!< I2C_T::CTL0: AA Mask                   */

#define I2C_CTL0_SI_Pos                  (3)                                               /*!< I2C_T::CTL0: SI Position               */
#define I2C_CTL0_SI_Msk                  (0x1ul << I2C_CTL0_SI_Pos)                        /*!< I2C_T::CTL0: SI Mask                   */

#define I2C_CTL0_STO_Pos                 (4)                                               /*!< I2C_T::CTL0: STO Position              */
#define I2C_CTL0_STO_Msk                 (0x1ul << I2C_CTL0_STO_Pos)                       /*!< I2C_T::CTL0: STO Mask                  */

#define I2C_CTL0_STA_Pos                 (5)                                               /*!< I2C_T::CTL0: STA Position              */
#define I2C_CTL0_STA_Msk                 (0x1ul << I2C_CTL0_STA_Pos)                       /*!< I2C_T::CTL0: STA Mask                  */

#define I2C_CTL0_I2CEN_Pos               (6)                                               /*!< I2C_T::CTL0: I2CEN Position            */
#define I2C_CTL0_I2CEN_Msk               (0x1ul << I2C_CTL0_I2CEN_Pos)                     /*!< I2C_T::CTL0: I2CEN Mask                */

#define I2C_CTL0_INTEN_Pos               (7)                                               /*!< I2C_T::CTL0: INTEN Position            */
#define I2C_CTL0_INTEN_Msk               (0x1ul << I2C_CTL0_INTEN_Pos)                     /*!< I2C_T::CTL0: INTEN Mask                */

#define I2C_CTL0_DPBITSEL_Pos            (8)                                               /*!< I2C_T::CTL0: DPBITSEL Position         */
#define I2C_CTL0_DPBITSEL_Msk            (0x3ul << I2C_CTL0_DPBITSEL_Pos)                  /*!< I2C_T::CTL0: DPBITSEL Mask             */

#define I2C_CTL0_DPCINTEN_Pos            (12)                                              /*!< I2C_T::CTL0: DPCINTEN Position         */
#define I2C_CTL0_DPCINTEN_Msk            (0x1ul << I2C_CTL0_DPCINTEN_Pos)                  /*!< I2C_T::CTL0: DPCINTEN Mask             */

#define I2C_CTL0_SRCINTEN_Pos            (13)                                              /*!< I2C_T::CTL0: SRCINTEN Position         */
#define I2C_CTL0_SRCINTEN_Msk            (0x1ul << I2C_CTL0_SRCINTEN_Pos)                  /*!< I2C_T::CTL0: SRCINTEN Mask             */

#define I2C_CTL0_DPCIF_Pos               (14)                                              /*!< I2C_T::CTL0: DPCIF Position            */
#define I2C_CTL0_DPCIF_Msk               (0x1ul << I2C_CTL0_DPCIF_Pos)                     /*!< I2C_T::CTL0: DPCIF Mask                */

#define I2C_CTL0_SARCIF_Pos              (15)                                              /*!< I2C_T::CTL0: SARCIF Position           */
#define I2C_CTL0_SARCIF_Msk              (0x1ul << I2C_CTL0_SARCIF_Pos)                    /*!< I2C_T::CTL0: SARCIF Mask               */

#define I2C_ADDR0_GC_Pos                 (0)                                               /*!< I2C_T::ADDR0: GC Position              */
#define I2C_ADDR0_GC_Msk                 (0x1ul << I2C_ADDR0_GC_Pos)                       /*!< I2C_T::ADDR0: GC Mask                  */

#define I2C_ADDR0_ADDR_Pos               (1)                                               /*!< I2C_T::ADDR0: ADDR Position            */
#define I2C_ADDR0_ADDR_Msk               (0x3fful << I2C_ADDR0_ADDR_Pos)                   /*!< I2C_T::ADDR0: ADDR Mask                */

#define I2C_DAT_DAT_Pos                  (0)                                               /*!< I2C_T::DAT: DAT Position               */
#define I2C_DAT_DAT_Msk                  (0xfful << I2C_DAT_DAT_Pos)                       /*!< I2C_T::DAT: DAT Mask                   */

#define I2C_STATUS0_STATUS_Pos           (0)                                               /*!< I2C_T::STATUS0: STATUS Position        */
#define I2C_STATUS0_STATUS_Msk           (0xfful << I2C_STATUS0_STATUS_Pos)                /*!< I2C_T::STATUS0: STATUS Mask            */

#define I2C_CLKDIV_DIVIDER_Pos           (0)                                               /*!< I2C_T::CLKDIV: DIVIDER Position        */
#define I2C_CLKDIV_DIVIDER_Msk           (0x3fful << I2C_CLKDIV_DIVIDER_Pos)               /*!< I2C_T::CLKDIV: DIVIDER Mask            */

#define I2C_CLKDIV_NFCNT_Pos             (12)                                              /*!< I2C_T::CLKDIV: NFCNT Position          */
#define I2C_CLKDIV_NFCNT_Msk             (0xful << I2C_CLKDIV_NFCNT_Pos)                   /*!< I2C_T::CLKDIV: NFCNT Mask              */

#define I2C_TOCTL_TOIF_Pos               (0)                                               /*!< I2C_T::TOCTL: TOIF Position            */
#define I2C_TOCTL_TOIF_Msk               (0x1ul << I2C_TOCTL_TOIF_Pos)                     /*!< I2C_T::TOCTL: TOIF Mask                */

#define I2C_TOCTL_TOCDIV4_Pos            (1)                                               /*!< I2C_T::TOCTL: TOCDIV4 Position         */
#define I2C_TOCTL_TOCDIV4_Msk            (0x1ul << I2C_TOCTL_TOCDIV4_Pos)                  /*!< I2C_T::TOCTL: TOCDIV4 Mask             */

#define I2C_TOCTL_TOCEN_Pos              (2)                                               /*!< I2C_T::TOCTL: TOCEN Position           */
#define I2C_TOCTL_TOCEN_Msk              (0x1ul << I2C_TOCTL_TOCEN_Pos)                    /*!< I2C_T::TOCTL: TOCEN Mask               */

#define I2C_TOCTL_TOBAUD_Pos             (3)                                               /*!< I2C_T::TOCTL: TOBAUD Position          */
#define I2C_TOCTL_TOBAUD_Msk             (0x1ul << I2C_TOCTL_TOBAUD_Pos)                   /*!< I2C_T::TOCTL: TOBAUD Mask              */

#define I2C_TOCTL_TONIDLE_Pos            (8)                                               /*!< I2C_T::TOCTL: TONIDLE Position         */
#define I2C_TOCTL_TONIDLE_Msk            (0x1ul << I2C_TOCTL_TONIDLE_Pos)                  /*!< I2C_T::TOCTL: TONIDLE Mask             */

#define I2C_ADDR1_GC_Pos                 (0)                                               /*!< I2C_T::ADDR1: GC Position              */
#define I2C_ADDR1_GC_Msk                 (0x1ul << I2C_ADDR1_GC_Pos)                       /*!< I2C_T::ADDR1: GC Mask                  */

